#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_iam_role.bottel-dynamodb-role: Refreshing state... [id=bottel-dynamodb-role]
aws_s3_bucket.cdn_bucket: Refreshing state... [id=bottel-cdn]
aws_cognito_user_pool.bottel-user-pool: Refreshing state... [id=us-east-1_Qw7pOPfDK]
aws_dynamodb_table.bottles-table: Refreshing state... [id=Bottles]
aws_appsync_graphql_api.bottel-api: Refreshing state... [id=3t5rpj5s2rd5vcjek3627sxmeq]
aws_appsync_datasource.bottles-datasource: Refreshing state... [id=3t5rpj5s2rd5vcjek3627sxmeq-bottles_datasource]
aws_iam_role_policy.bottel-dynamodb-policy: Refreshing state... [id=bottel-dynamodb-role:bottel-dynamodb-policy]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_iam_role.bottel-dynamodb-role has changed
  ~ resource "aws_iam_role" "bottel-dynamodb-role" {
        id                    = "bottel-dynamodb-role"
        name                  = "bottel-dynamodb-role"
      + tags                  = {}
        # (9 unchanged attributes hidden)

      - inline_policy {}
      + inline_policy {
          + name   = "bottel-dynamodb-policy"
          + policy = jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "dynamodb:*",
                            ]
                          + Effect   = "Allow"
                          + Resource = [
                              + "arn:aws:dynamodb:us-east-1:062130427086:table/Bottles",
                            ]
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            )
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_appsync_graphql_api.bottel-api will be updated in-place
  ~ resource "aws_appsync_graphql_api" "bottel-api" {
        id                  = "3t5rpj5s2rd5vcjek3627sxmeq"
        name                = "bottel-api"
      + schema              = <<-EOT
            type Query {
                getBottle(id: ID!): Bottle
                listBottles(filter: BottleFilterInput, limit: Int, nextToken: String): BottleConnection
            }
            
            type Mutation {
                createBottle(input: CreateBottleInput!): Bottle
                updateBottle(input: UpdateBottleInput!): Bottle
                deleteBottle(input: DeleteBottleInput!): Bottle
            }
            
            type Bottle {
                id: ID!
                name: String!
                imageUrl: String
                dateOpened: String
                dateAcquired: String
            }
            
            type BottleConnection {
                items: [Bottle]
                nextToken: String
            }
            
            input BottleFilterInput {
                id: TableIDFilterInput
                name: TableStringFilterInput
                imageUrl: TableStringFilterInput
                dateOpened: TableStringFilterInput
                dateAcquired: TableStringFilterInput
            }
            
            input CreateBottleInput {
                name: String!
                imageUrl: String
                dateOpened: String
                dateAcquired: String
            }
            
            input UpdateBottleInput {
                id: ID!
                name: String
                imageUrl: String
                dateOpened: String
                dateAcquired: String
            }
            
            input DeleteBottleInput {
                id: ID!
            }
            
            input TableIDFilterInput {
                ne: ID
                eq: ID
                le: ID
                lt: ID
                ge: ID
                gt: ID
                contains: ID
                notContains: ID
                between: [ID]
                beginsWith: ID
            }
            
            input TableStringFilterInput {
                ne: String
                eq: String
                le: String
                lt: String
                ge: String
                gt: String
                contains: String
                notContains: String
                between: [String]
                beginsWith: String
            }
            
            input TableBooleanFilterInput {
                ne: Boolean
                eq: Boolean
            }
            
            input TableIntFilterInput {
                ne: Int
                eq: Int
                le: Int
                lt: Int
                ge: Int
                gt: Int
                contains: Int
                notContains: Int
                between: [Int]
            }
        EOT
        tags                = {}
        # (5 unchanged attributes hidden)

      ~ user_pool_config {
          ~ default_action = "DENY" -> "ALLOW"
            # (2 unchanged attributes hidden)
        }
    }

  # aws_cognito_user_pool_client.client will be created
  + resource "aws_cognito_user_pool_client" "client" {
      + callback_urls                 = (known after apply)
      + client_secret                 = (sensitive value)
      + enable_token_revocation       = (known after apply)
      + id                            = (known after apply)
      + logout_urls                   = (known after apply)
      + name                          = "bottel-client"
      + prevent_user_existence_errors = (known after apply)
      + refresh_token_validity        = 30
      + user_pool_id                  = "us-east-1_Qw7pOPfDK"
    }

Plan: 1 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>